Repository: vincode-io/VinCloudKit
Catalog: Sources/VinCloudKit/Resources/Localizable.xcstrings
Source language: en
Languages: de

# error.text.account-temporarily-unavailable
source: The iCloud Account is temporarily unavailable.
de: Das iCloud-Konto ist vorübergehend nicht verfügbar.

# error.text.already-shared
source: A record or share cannot be saved because doing so would cause the same hierarchy of records to exist in multiple shares.
de: Ein Datensatz oder eine Freigabe kann nicht gespeichert werden, da dies dazu führen würde, dass dieselbe Hierarchie von Datensätzen in mehreren Freigaben existiert.

# error.text.asset-file-modified
source: Asset File Modified: the content of the specified asset file was modified while being saved.
de: Asset-Datei verändert: Der Inhalt der angegebenen Asset-Datei wurde während des Speicherns verändert.

# error.text.asset-file-not-found
source: Asset File Not Found: the specified asset file is not found.
de: Asset-Datei nicht gefunden: Die angegebene Asset-Datei wurde nicht gefunden.

# error.text.bad-container
source: Bad Container: the specified container is unknown or unauthorized.
de: Ungültiger Container: Der angegebene Container ist unbekannt oder nicht autorisiert.

# error.text.bad-database
source: Bad Database: the operation could not be completed on the given database.
de: Ungültige Datenbank: Der Vorgang konnte in der angegebenen Datenbank nicht abgeschlossen werden.

# error.text.batch-request-failed
source: Batch Request Failed: the entire batch was rejected.
de: Stapel-Anfrage fehlgeschlagen: Der gesamte Stapel wurde abgelehnt.

# error.text.change-token-expired
source: Change Token Expired: the previous server change token is too old.
de: Änderungs-Token abgelaufen: Das vorherige Server-Änderungs-Token ist zu alt.

# error.text.constraint-violation
source: Constraint Violation: the server rejected the request because of a conflict with a unique field.
de: Einschränkungsverletzung: Der Server hat die Anfrage aufgrund eines Konflikts mit einem eindeutigen Feld abgelehnt.

# error.text.corrupt-account
source: There is an unrecoverable problem with your application iCloud account. Please make sure you have iCloud and iCloud Drive enabled in System Preferences. Then remove the application iCloud account and add it again.
de: Es gibt ein nicht behebbares Problem mit Ihrem iCloud-Konto der Anwendung. Stellen Sie sicher, dass iCloud und iCloud Drive in den Systemeinstellungen aktiviert sind. Entfernen Sie dann das iCloud-Konto der Anwendung und fügen Sie es erneut hinzu.

# error.text.incompatible-version
source: Incompatible Version: your app version is older than the oldest version allowed.
de: Inkompatible Version: Ihre App-Version ist älter als die älteste zulässige Version.

# error.text.internal-error
source: Internal Error: a non-recoverable error was encountered by CloudKit.
de: Interner Fehler: CloudKit ist auf einen nicht behebbaren Fehler gestoßen.

# error.text.invalid-arguments
source: Invalid Arguments: the specified request contains bad information.
de: Ungültige Argumente: Die angegebene Anfrage enthält fehlerhafte Informationen.

# error.text.limit-exceeded
source: Limit Exceeded: the request to the server is too large.
de: Limit überschritten: Die Anfrage an den Server ist zu groß.

# error.text.managed-account-restricted
source: Managed Account Restricted: the request was rejected due to a managed-account restriction.
de: Verwaltetes Konto eingeschränkt: Die Anfrage wurde aufgrund einer Einschränkung für verwaltete Konten abgelehnt.

# error.text.max-child-count-exceeded
source: The maximum number of child rows that iCloud can sync is 750. This limit has been exceeded. Please reduce the number of child rows to continue syncing.
de: Die maximale Anzahl von Unterzeilen, die iCloud synchronisieren kann, beträgt 750. Dieses Limit wurde überschritten. Reduzieren Sie die Anzahl der Unterzeilen, um die Synchronisierung fortzusetzen.

# error.text.missing-entitlement
source: Missing Entitlement: the app is missing a required entitlement.
de: Fehlende Berechtigung: Der App fehlt eine erforderliche Berechtigung.

# error.text.network-failure
source: Network Failure: the internet connection appears to be offline.
de: Netzwerkfehler: Die Internetverbindung scheint offline zu sein.

# error.text.network-unavailable
source: Network Unavailable: the internet connection appears to be offline.
de: Netzwerk nicht verfügbar: Die Internetverbindung scheint offline zu sein.

# error.text.not-authenticated
source: Not Authenticated: to use the iCloud account, you must enable iCloud Drive. Go to device Settings, sign in to iCloud, then in the app settings, be sure the iCloud Drive feature is enabled.
de: Nicht authentifiziert: Um das iCloud-Konto zu verwenden, müssen Sie iCloud Drive aktivieren. Gehen Sie zu den Geräteeinstellungen, melden Sie sich bei iCloud an und stellen Sie sicher, dass die iCloud Drive-Funktion in den App-Einstellungen aktiviert ist.

# error.text.operation-canceled
source: Operation Canceled: the operation was explicitly canceled.
de: Vorgang abgebrochen: Der Vorgang wurde explizit abgebrochen.

# error.text.partial-failure
source: Partial Failure: some items failed, but the operation succeeded overall.
de: Teilweiser Fehler: Einige Elemente sind fehlgeschlagen, aber der Vorgang war insgesamt erfolgreich.

# error.text.participant-may-need-verification
source: Participant May Need Verification: you are not a member of the share.
de: Teilnehmer benötigt möglicherweise Verifizierung: Sie sind kein Mitglied der Freigabe.

# error.text.permission-failure
source: Permission Failure: to use this app, you must enable iCloud Drive. Go to device Settings, sign in to iCloud, then in the app settings, be sure the iCloud Drive feature is enabled.
de: Berechtigungsfehler: Um diese App zu verwenden, müssen Sie iCloud Drive aktivieren. Gehen Sie zu den Geräteeinstellungen, melden Sie sich bei iCloud an und stellen Sie sicher, dass die iCloud Drive-Funktion in den App-Einstellungen aktiviert ist.

# error.text.quota-exceeded
source: Quota Exceeded: saving would exceed your current iCloud storage quota.
de: Kontingent überschritten: Das Speichern würde Ihr aktuelles iCloud-Speicherkontingent überschreiten.

# error.text.reference-violation
source: Reference Violation: the target of a record's parent or share reference was not found.
de: Referenzverletzung: Das Ziel einer übergeordneten oder Freigabe-Referenz eines Datensatzes wurde nicht gefunden.

# error.text.request-rate-limited
source: Request Rate Limited: transfers to and from the server are being rate limited at this time.
de: Anfragerate begrenzt: Übertragungen zum und vom Server werden derzeit ratenbegrenzt.

# error.text.server-record-changed
source: Server Record Changed: the record was rejected because the version on the server is different.
de: Server-Datensatz geändert: Der Datensatz wurde abgelehnt, da die Version auf dem Server anders ist.

# error.text.server-rejected-request
source: Server Rejected Request
de: Server hat Anfrage abgelehnt

# error.text.server-response-lost
source: Server Response Lost
de: Server-Antwort verloren

# error.text.service-unavailable
source: Service Unavailable: Please try again.
de: Service nicht verfügbar: Bitte versuchen Sie es erneut.

# error.text.too-many-participants
source: Too Many Participants: a share cannot be saved because too many participants are attached to the share.
de: Zu viele Teilnehmer: Eine Freigabe kann nicht gespeichert werden, da zu viele Teilnehmer mit der Freigabe verknüpft sind.

# error.text.unexpected-cloudkit-error
source: An unexpected CloudKit error occurred.
de: Ein unerwarteter CloudKit-Fehler ist aufgetreten.

# error.text.unknown-cloudkit-error
source: Unknown iCloud Error
de: Unbekannter iCloud-Fehler

# error.text.unknown-item
source: Unknown Item: the specified record does not exist.
de: Unbekanntes Element: Der angegebene Datensatz existiert nicht.

# error.text.user-deleted-data
source: The iCloud data was deleted. Please remove the application iCloud account and add it again to continue using the application's iCloud support.
de: Die iCloud-Daten wurden gelöscht. Entfernen Sie das iCloud-Konto der Anwendung und fügen Sie es erneut hinzu, um die iCloud-Unterstützung der Anwendung weiterhin zu nutzen.

# error.text.user-deleted-zone
source: User Deleted Zone: the user has deleted this zone from the Settings UI.
de: Benutzer hat Zone gelöscht: Der Benutzer hat diese Zone über die Einstellungs-Benutzeroberfläche gelöscht.

# error.text.zone-busy
source: Zone Busy: the server is too busy to handle the zone operation.
de: Zone beschäftigt: Der Server ist zu beschäftigt, um den Zonenvorgang zu bearbeiten.

# error.text.zone-not-found
source: Zone Not Found: the specified record zone does not exist on the server.
de: Zone nicht gefunden: Die angegebene Datensatz-Zone existiert nicht auf dem Server.
